/* %1$@ = Make GIF; %2$@ = Take Photo */
"Drag %1$@ after the\n%2$@ action." = "ลาก %1$@ หลังจาก\nการกระทำ %2$@";

/* %1$@ = Take Photo, %2$@ = “left” or “right” */
"Drag %1$@ to the %2$@." = "ลาก %1$@ ไปด้าน%2$@";

/* %1$@ = a localized and formatted number; %2$@ = a unit; e.g “15 kg” */
"%1$@ %2$@" = "%1$@ %2$@";

/* %@ = Quick Look */
"Add %@ to\npreview your GIF." = "เพิ่ม %@ เพื่อ\nแสดงตัวอย่าง GIF ของคุณ";

/* %@ = shortcut name */
"Added shortcut: %@" = "คำสั่งลัดที่เพิ่มไว้: %@";

/* A message; shortcuts on watch have been reset */
"Your shortcuts have been reset. Re-open the Shortcuts app to continue." = "คำสั่งลัดของคุณถูกรีเซ็ตแล้ว โปรดเปิดแอพคำสั่งลัดอีกครั้งเพื่อดำเนินการต่อ";

/* Accessibility hint for today widget shortcut that is not running but will run if you tap on it; %@=shortcut name */
"Runs the shortcut %@" = "สั่งทำงานคำสั่งลัด %@";

/* Accessibility hint for today widget shortcut when the shortcut is running; %lu=percentage completed */
"Running, %lu%% complete" = "ใช้งานอยู่ เสร็จสิ้น %lu%%";

/* Accessibility label */
"Edit profile photo" = "แก้ไขรูปภาพโปรไฟล์";

/* Accessibility label describing a video in the on-boarding flow */
"An animation of Notification Center being pulled down from the top of the screen" = "ภาพเคลื่อนไหวของศูนย์การแจ้งเตือนที่ถูกเลื่อนลงมาจากด้านบนสุดของหน้าจอ";

/* Accessibility label describing a video in the on-boarding flow */
"An animation of adding the Shortcuts widget to the list of active widgets" = "ภาพเคลื่อนไหวของการเพิ่มวิดเจ็ตคำสั่งลัดไปยังรายการของวิดเจ็ตที่ใช้งานอยู่";

/* Accessibility label describing a video in the on-boarding flow */
"An animation of scrolling to the bottom of the widgets list and tapping Edit" = "ภาพเคลื่อนไหวของการเลื่อนลงด้านล่างสุดของรายการวิดเจ็ตและการแตะแก้ไข";

/* Accessibility label describing a video in the on-boarding flow */
"An animation of swiping left to the list of widgets" = "ภาพเคลื่อนไหวของการปัดไปทางซ้ายของรายการวิดเจ็ต";

/* Accessibility label in on-boarding flow */
"A screenshot of Notification Center with the Shortcuts widget" = "ภาพหน้าจอของศูนย์การแจ้งเตือนที่มีวิดเจ็ตคำสั่งลัด";

/* Accessibility label. %1$@ = workflow name; %2$@ = workflow short description */
"%1$@, %2$@" = "%1$@ %2$@";

/* Accessibility label; %@ = user’s name */
"%@’s profile picture" = "รูปภาพโปรไฟล์ของ %@";

/* Accessibility label; option (Twitter handle, website, as email) is NOT selected as main identity; tap to make main identity */
"Make main identity" = "สร้างข้อมูลประจำตัวหลัก";

/* Accessibility label; option (Twitter handle, website, as email) is selected as main identity */
"Selected as main identity" = "เลือกเป็นข้อมูลประจำตัวหลักอยู่";

/* Accessiblity label; +/- key on number pad */
"Plus, Minus" = "บวก, ลบ";

/* Accessiblity label; backspace key on number pad */
"Backspace" = "Backspace";

/* Accessiblity label; decimal key on number pad */
"Decimal" = "ทศนิยม";

/* Action extension; missing input from app error message */
"Unfortunately, there is nothing Shortcuts can do about this; it is due to a bug in the host app. We’d recommend contacting the maker of that app and letting them know of this problem." = "ขออภัย คำสั่งลัดไม่สามารถแก้ไขเรื่องนี้ได้เนื่องจากมีข้อบกพร่องในแอพที่เป็นโฮสต์ เราขอแนะนำให้ติดต่อผู้ผลิตแอพนั้นและแจ้งให้ทราบถึงปัญหานี้";

/* Action extension; missing input from app error title */
"The app that opened this extension did not provide any input." = "แอพที่เปิดส่วนขยายนี้ไม่ได้ให้ข้อมูลเข้าใดๆ";

/* Alert body; importing shortcut failed */
"The shortcut could not be downloaded." = "ไม่สามารถดาวน์โหลดคำสั่งลัดได้";

/* Alert message; shortcut on watch has been created by newer version of shortcut and are incompatible */
"The Shortcuts database cannot be read because it was created by a newer version of Shortcuts.\n\nYou can either upgrade Shortcuts or reset your shortcuts. Your shortcuts will be lost, but if you use iCloud Sync they will be restored." = "ไม่สามารถอ่านฐานข้อมูลคำสั่งลัดได้เนื่องจากฐานข้อมูลถูกสร้างขึ้นโดยแอพคำสั่งลัดเวอร์ชั่นที่ใหม่กว่า\n\nคุณสามารถอัพเกรดแอพคำสั่งลัดหรือรีเซ็ตคำสั่งลัดของคุณได้ คำสั่งลัดของคุณจะหายไป แต่ถ้าคุณใช้การเชื่อมข้อมูล iCloud คำสั่งลัดเหล่านั้นจะได้รับการกู้คืน";

/* Alert message; shortcuts database on device is corrupt */
"The Shortcuts database cannot be read because it is corrupt. You can fix this by resetting your shortcuts. Your shortcuts will be lost, but if you use iCloud Sync they will be restored." = "ไม่สามารถอ่านฐานข้อมูลคำสั่งลัดได้เนื่องจากฐานข้อมูลเสียหาย คุณสามารถแก้ไขปัญหานี้ได้โดยการรีเซ็ตคำสั่งลัดของคุณ คำสั่งลัดของคุณจะหายไป แต่ถ้าคุณใช้การเชื่อมข้อมูล iCloud คำสั่งลัดเหล่านั้นจะได้รับการกู้คืน";

/* Alert message; shortcuts database on device is corrupt */
"The Shortcuts database cannot be read because it is corrupt.\n\nYou can email support with your corrupted database or reset your custom shortcuts. Your shortcuts will be lost, but if you use iCloud Sync they will be restored." = "ไม่สามารถอ่านฐานข้อมูลคำสั่งลัดได้เนื่องจากฐานข้อมูลเสียหาย\n\nคุณสามารถส่งอีเมลไปยังฝ่ายบริการช่วยเหลือเกี่ยวกับฐานข้อมูลที่เสียหายของคุณหรือรีเซ็ตคำสั่งลัดแบบกำหนดเองของคุณได้ คำสั่งลัดของคุณจะหายไป แต่ถ้าคุณใช้การเชื่อมข้อมูล iCloud คำสั่งลัดเหล่านั้นจะได้รับการกู้คืน";

/* Alert option to email support; shortcuts database on device is corrupt */
"Email Support" = "บริการช่วยเหลือทางอีเมล";

/* Alert option to reset shortcuts on device */
"Reset Shortcuts" = "รีเซ็ตคำสั่งลัด";

/* Alert option to update the Shortcuts app (opens App Store); shortfut on watch has been created by newer version of shortcut and are incompatible */
"Update Shortcuts" = "อัพเดทคำสั่งลัด";

/* Alert title for an error */
"Aw no!" = "อุ้ย แย่แล้ว!";

/* Alert title; shortcut on watch has been created by newer version of shortcut and are incompatible */
"Shortcuts Version Mismatch" = "เวอร์ชั่นคำสั่งลัดไม่ตรงกัน";

/* Alert title; shortcuts on watch have been reset */
"Shortcuts Reset" = "รีเซ็ตคำสั่งลัดแล้ว";

/* Apple watch; label for result from running the shortcut */
"Result" = "ผลลัพธ์";

/* Apple watch; label for result from running the shortcut when there are multiple results; %ld=number of results */
"Results (%ld)" = "ผลลัพธ์ (%ld)";

/* Back button */
"Back" = "ย้อนกลับ";

/* Body of alert encouraging users to add the Shortcuts widget after they have tried to skip adding the widget. */
"Adding the widget dramatically improves the speed of running shortcuts. Are you sure you’d like to skip this step?" = "การเพิ่มวิดเจ็ตจะปรับปรุงความเร็วในการสั่งทำงานคำสั่งลัดให้ดียิ่งขึ้น คุณแน่ใจหรือไม่ว่าคุณต้องการที่จะข้ามขั้นตอนนี้";

/* Body of alert when the user’s gallery submission didn’t go through due to an error */
"Your submission didn’t go through! Try again in a few minutes." = "การส่งของคุณไปไม่ถึง! ลองอีกครั้งในอีกสองสามนาที";

/* Button */
"Cancel" = "ยกเลิก";

/* Button */
"Done" = "เสร็จสิ้น";

/* Button */
"Next" = "ถัดไป";

/* Button */
"OK" = "ตกลง";

/* Button */
"Submit your own workflow" = "ส่งเวิร์กโฟลว์ของคุณเอง";

/* Button for editing their profile picture */
"Edit" = "แก้ไข";

/* Button or nav bar title */
"Edit Profile" = "แก้ไขโปรไฟล์";

/* Button or title */
"Run shortcut" = "สั่งทำงานคำสั่งลัด";

/* Button or title to share a shortcut */
"Share Shortcut" = "แชร์คำสั่งลัด";

/* Button or title to submit a shortcut to the gallery */
"Submit Shortcut" = "ส่งคำสั่งลัด";

/* Button or title; user profile */
"Profile" = "โปรไฟล์";

/* Button that shows all collection search results */
"See All" = "ดูทั้งหมด";

/* Button title on alert to discard changes to profile */
"Discard Changes" = "ละทิ้งการแก้ไข";

/* Button title; create a new shortcut */
"Create Shortcut" = "สร้างคำสั่งลัด";

/* Button to add the Shortcuts Today Widget */
"Add Widget" = "เพิ่มวิดเจ็ต";

/* Button to keep both shortcuts when you try to import a shortcut with the same name */
"Keep Both" = "เก็บทั้งคู่";

/* Button to replace the older shortcut with the newer shortcut when you try to import a shortcut with the same name */
"Replace" = "แทนที่";

/* Button to skip a step */
"Skip" = "ข้าม";

/* Configure which shortcuts should show up on the watch app */
"Choose shortcuts to show on your watch." = "เลือกคำสั่งลัดเพื่อแสดงบนนาฬิกาข้อมือของคุณ";

/* Configure which shortcuts should show up on the watch complication */
"Choose shortcuts to show in the Complication." = "เลือกคำสั่งลัดเพื่อแสดงในกลไกหน้าปัด";

/* Copy content */
"Copy" = "คัดลอก";

/* Could not find shortcut to run */
"Could not find the specified shortcut." = "ไม่พบคำสั่งลัดที่ระบุเฉพาะ";

/* Could not find shortcut to run; %@=shortcut name */
"Could not find the shortcut “%@.”" = "ไม่พบคำสั่งลัด “%@”";

/* Default shortcut name to use if no name is provided */
"Untitled Shortcut" = "ไม่มีชื่อคำสั่งลัด";

/* Description of Siri feature on splash screen */
"Add any shortcut to Siri by recording a personalized voice phrase." = "เพิ่มคำสั่งลัดใดก็ได้ไปยัง Siri โดยการอัดคำสั่งเสียงของคุณด้วยตัวคุณเอง";

/* Description of intro feature on splash screen */
"Combine a series of steps into a single shortcut to automate what you do with your apps. " = "รวมทุกขั้นตอนไว้ในคำสั่งลัดเดียวเพื่อทำสิ่งที่คุณทำในแอพต่างๆ ของคุณโดยอัตโนมัติ";

/* Description of widget feature on splash screen */
"Access shortcuts even faster with the Shortcuts widget." = "เข้าถึงคำสั่งลัดได้รวดเร็วขึ้นอีกด้วยวิดเจ็ดคำสั่งลัด";

/* Edit profile photo; option to choose a photo from their iOS photo libary */
"Choose from Library" = "เลือกจากคลัง";

/* Edit profile photo; option to take a new photo to use */
"Take Photo" = "ถ่ายรูป";

/* Edit profile; Twitter handle field placeholder */
"@WorkflowHQ" = "@WorkflowHQ";

/* Edit profile; email field placeholder */
"johnny@workflow.is" = "johnny@workflow.is";

/* Edit profile; email field title */
"Email" = "อีเมล";

/* Edit profile; error message for when the provided website is invalid */
"The website URL “%@” is not valid." = "URL ของเว็บไซต์ “%@” ไม่ถูกต้อง";

/* Edit profile; error title for when the provided website is invalid */
"Invalid Website" = "เว็บไซต์ไม่ถูกต้อง";

/* Edit profile; explanation to users on how their name will appear on published workflows; %@ = name, Twitter handle, or website */
"You will be credited as “%@” on your published workflows." = "คุณจะได้รับเครดิตเป็น “%@” บนเวิร์กโฟลว์ที่เผยแพร่ของคุณ";

/* Edit profile; person name field title */
"Name" = "ชื่อ";

/* Edit profile; person name field title (required) */
"Name (Required)" = "ชื่อ (บังคับ)";

/* Edit profile; section header for private information (e.g. Email address) */
"Private Information" = "ข้อมูลส่วนตัว";

/* Edit profile; section header for public information (e.g. Twitter handle) */
"Public Information" = "ข้อมูลสาธารณะ";

/* Edit profile; website field placeholder */
"www.workflow.is" = "www.workflow.is";

/* Empty state description when there are no search results; %@ = query */
"We didn’t turn up anything for “%@”. Try something else." = "ไม่พบผลการค้นหาสำหรับ “%@” โปรดลองค้นหาอย่างอื่น";

/* Empty state indicating that a user has no workflows */
"No shortcuts." = "ไม่มีคำสั่งลัด";

/* Empty state title indicating no search results when searching for a workflow or collection in the gallery */
"No Results" = "ไม่มีผลการค้นหา";

/* Error alert body when importing a shortcut fails */
"The shortcut URL provided was invalid." = "URL คำสั่งลัดที่ให้ไว้ไม่ถูกต้อง";

/* Error alert title when importing a shortcut fails */
"Import Failed" = "นำเข้าไม่สำเร็จ";

/* Error message */
"There are no photos in your photo library." = "ไม่มีรูปภาพในคลังรูปภาพของคุณ";

/* Error message description */
"The shortcut link may be invalid, or it may have been deleted." = "ลิงก์คำสั่งลัดอาจจะไม่ถูกต้องหรืออาจจะถูกลบไปแล้ว";

/* Error message shown when the gallery does not load */
"Can’t connect to the Gallery." = "ไม่สามารถเชื่อมต่อกับคลังได้";

/* Error message title */
"Shortcut Not Found" = "ไม่พบคำสั่งลัด";

/* Error message when a collection does not load */
"Couldn't load this collection." = "ไม่สามารถโหลดคอลเลกชั่นนี้ได้";

/* Error message when the collection fails to load */
"Couldn’t load this collection." = "ไม่สามารถโหลดคอลเลกชั่นนี้ได้";

/* Error presented to the user when an action times out while running (%@ = the name of the action) */
"The “%@” action took too long to finish running." = "การกระทำ “%@” ใช้เวลานานเกินไปในการทำงานให้เสร็จสิ้น";

/* Exit the app (kills the app) */
"Exit" = "ออก";

/* Gallery search section title for collection search results */
"Collections" = "คอลเลกชั่น";

/* Gallery search; button to show fewer collection search results */
"Show Less" = "แสดงน้อยลง";

/* Gallery search; button to show more collection search results */
"Show More" = "แสดงเพิ่มเติม";

/* Generic title for a notification show in the app */
"Notification" = "การแจ้งเตือน";

/* Guided tour; The “Shortcuts” part in the localized string “\n\nShortcuts are made of a series of actions (the items on the left).\n\nNext, let’s add a Make GIF action, which will animate the photos from the first action.”; used for highlighting */
"Shortcuts (Guided Tour)" = "คำสั่งลัด";

/* Guided tour; The “actions” part in the localized string “\n\nShortcuts are made of a series of actions (the items on the left).\n\nNext, let’s add a Make GIF action, which will animate the photos from the first action.”; used for highlighting */
"actions" = "การกระทำ";

/* Guided tour; Title for an alert that is shown along side an example shortcut */
"This is a shortcut." = "นี่คือคำสั่งลัด";

/* Guided tour; a happy title for an alert that is show when the user has created their first workflow */
"Congrats!" = "ยินดีด้วย!";

/* Guided tour; a happy title for an alert that is shown after a user runs their first shortcut */
"Woot!" = "ไชโย!";

/* Guided tour; a more descriptive name for the play button; only used for accessibility */
"run shortcut button" = "ปุ่มสั่งทำงานคำสั่งลัด";

/* Guided tour; let user know that they can drag an action from the actions pane from the left (on the right on RTL devices) to share the GIF */
"Drag over an action to share your GIF." = "ลากไปไว้ด้านบนการกระทำเพื่อแชร์ GIF ของคุณ";

/* Guided tour; run workflow button that looks like a classic play button (sideways triangle); should be the exact name that is used in the “\n\nYou just created a workflow. Now press the play button to run it!” localized string because it will be used to highlight the text */
"play button" = "ปุ่มเล่น";

/* Guided tour; shown below “Aw no!” */
"\n\nSomething went wrong. Try again or tap Done." = "\n\nมีบางอย่างผิดพลาด โปรดลองอีกครั้งหรือแตะเสร็จสิ้น";

/* Guided tour; shown below “Aw no!” */
"\n\nYou didn’t finish running the shortcut. Try again or tap Done." = "\n\nคุณสั่งทำงานคำสั่งลัดไม่เสร็จสิ้น โปรดลองอีกครั้งหรือแตะเสร็จสิ้น";

/* Guided tour; shown below “Congrats!” */
"\n\nYou just created a shortcut. Now press the play button to run it!" = "\n\nคุณก็แค่สร้างคำสั่งลัด แล้วกดปุ่มเล่นเพื่อสั่งทำงานตอนนี้เลย!";

/* Guided tour; shown below “This is a shortcut.”; for RTL, left should be right */
"\n\nShortcuts are made of a series of actions (the items on the left).\n\nNext, let’s add a Make GIF action, which will animate the photos from the first action." = "\n\nคำสั่งลัดทำจากชุดการกระทำ (รายการด้านซ้าย)\n\nต่อจากนั้นมาเพิ่มการกระทำสร้าง GIF ซึ่งจะทำให้รูปภาพเป็นภาพเคลื่อนไหวตั้งแต่การกระทำแรกกันเถอะ";

/* Guided tour; shown below “Welcome to Shortcuts” */
"\n\nLet’s build a shortcut to make an animated GIF." = "\n\nมาสร้างคำสั่งลัดเพื่อทำให้ GIF เป็นภาพเคลื่อนไหวกันเถอะ";

/* Guided tour; shown below “Woot!” */
"\n\nYou just ran a shortcut. Wasn’t that cool?" = "\n\nคุณก็แค่สั่งทำงานคำสั่งลัด เจ๋งไปเลยใช่ไหมล่ะ";

/* Guided tour; welcome to shortcut title */
"Welcome to Shortcuts." = "ยินดีต้อนรับสู่แอพคำสั่งลัด";

/* Information about what happens when a user submits a workflow to the gallery */
"By tapping “Submit”, your workflow will be submitted for review. If we decide to include your workflow in the Gallery, we’ll notify you by e-mail." = "เมื่อแตะ “ส่ง” แล้ว เวิร์กโฟลว์ของคุณจะถูกส่งไปตรวจสอบ ถ้าเราตัดสินใจที่จะใส่เวิร์กโฟลว์ของคุณไว้ในแกลเลอรี่ เราจะแจ้งให้คุณทราบทางอีเมล";

/* Make GIF action name */
"Make GIF" = "สร้าง GIF";

/* Media file name label */
"Media File" = "ไฟล์สื่อ";

/* Message of alert when a user tries to import a shortcut with the same name */
"Would you like to replace your shortcut?" = "คุณต้องการที่จะแทนที่คำสั่งลัดของคุณหรือไม่";

/* Navigation bar title for the form to fill out with the workflow’s information to submit to the gallery */
"Workflow Info" = "ข้อมูลเวิร์กโฟลว์";

/* None option */
"None" = "ไม่มี";

/* Onboarding-flow; user already has widget */
"Great! It looks like you've already added the Shortcuts Widget. Let's keep going." = "เยี่ยมเลย! ดูเหมือนว่าคุณได้เพิ่มวิดเจ็ตคำสั่งลัดนี้อยู่แล้ว ไปทำขั้นต่อไปกันเถอะ";

/* Onboarding-flow; user does not have widget; text to convice user to get the widget */
"Run shortcuts crazy fast with the Shortcuts Widget." = "สั่งทำงานคำสั่งลัดอย่างรวดเร็วด้วยวิดเจ็ดคำสั่งลัด";

/* Placeholder for the description field when submitting a workflow to the gallery */
"Please write a description of what your workflow does here." = "โปรดเขียนคำอธิบายเกี่ยวกับสิ่งที่เวิร์กโฟลว์ของคุณทำที่นี่";

/* Placeholder for the longer-form description field when submitting a workflow to the gallery */
"Please write a more detailed description of what your workflow does here." = "โปรดเขียนคำอธิบายเพิ่มเติมแบบละเอียดเกี่ยวกับสิ่งที่เวิร์กโฟลว์ของคุณทำที่นี่";

/* Placeholder for the name field in Edit Profile */
"Johnny Appleseed" = "Johnny Appleseed";

/* Placeholder for the short description field when submitting a workflow to the gallery */
"Please write a brief description of what your workflow does here." = "โปรดเขียนคำอธิบายแบบย่อเกี่ยวกับสิ่งที่เวิร์กโฟลว์ของคุณทำที่นี่";

/* Print content */
"Print" = "พิมพ์";

/* Quick Look action name */
"Quick Look" = "ดูแบบรวดเร็ว";

/* Recovery option for when the gallery does not load */
"Try Again" = "ลองอีกครั้ง";

/* Recovery option for when the gallery does not load and the user should enable Wi-Fi, etc. in the Settings app */
"Open Settings" = "เปิดการตั้งค่า";

/* Recovery suggestion for when the gallery does not load because there is no network connection */
"Turn on cellular data or use WLAN to access the Gallery." = "เปิดใช้ข้อมูลเซลลูลาร์หรือใช้ WLAN เพื่อเข้าถึงแกลเลอรี่";

/* Recovery suggestion for when the gallery does not load because there is no network connection */
"Turn on cellular data or use Wi-Fi to access the Gallery." = "เปิดใช้ข้อมูลเซลลูลาร์หรือใช้ Wi-Fi เพื่อเข้าถึงแกลเลอรี่";

/* Recovery suggestion for when the gallery does not load because there is no network connection and the user has Airplane Mode enabled */
"Turn off Airplane Mode or use WLAN to access the Gallery." = "ปิดใช้โหมดเครื่องบินหรือใช้ WLAN เพื่อเข้าถึงแกลเลอรี่";

/* Recovery suggestion for when the gallery does not load because there is no network connection and the user has Airplane Mode enabled */
"Turn off Airplane Mode or use Wi-Fi to access the Gallery." = "ปิดใช้โหมดเครื่องบินหรือใช้ Wi-Fi เพื่อเข้าถึงแกลเลอรี่";

/* Save as image */
"Save Image" = "บันทึกภาพ";

/* Search gallery */
"Search" = "ค้นหา";

/* Section title */
"Shortcuts" = "คำสั่งลัด";

/* Share via AirDrop */
"AirDrop" = "AirDrop";

/* Share via CloudApp */
"CloudApp" = "CloudApp";

/* Share via DeskConnect */
"DeskConnect" = "DeskConnect";

/* Share via Evernote */
"Evernote" = "Evernote";

/* Share via Facebook */
"Facebook" = "Facebook";

/* Share via Instagram */
"Instagram" = "Instagram";

/* Share via Instapaper */
"Instapaper" = "Instapaper";

/* Share via Mail */
"Mail" = "เมล";

/* Share via Messages */
"Message" = "ข้อความ";

/* Share via Pinboard */
"Pinboard" = "Pinboard";

/* Share via Pocket */
"Pocket" = "Pocket";

/* Share via Slack */
"Slack" = "Slack";

/* Shortcut has been submitted to the gallery */
"Shortcut Submitted" = "ส่งคำสั่งลัดแล้ว";

/* Shown in HUD after downloading a shortcut from the gallery */
"Added to Library" = "เพิ่มไปยังคลังแล้ว";

/* Splash screen primary button title */
"Get Started" = "เริ่มต้น";

/* Splash screen title */
"Welcome to Shortcuts" = "ยินดีต้อนรับสู่แอพคำสั่งลัด";

/* Stop running the shortcut; %@=shortcut name */
"Stop %@" = "หยุด %@";

/* Take Photo action name */
"Take Photo (action name)" = "ถ่ายรูป";

/* Tap to choose an option */
"Tap to Choose" = "แตะเพื่อเลือก";

/* Terms and Conditions view title */
"Terms and Conditions" = "ข้อกำหนดและเงื่อนไข";

/* The user has submitted the shortcut to the gallery for approval and will be notified when it is approved to be included in the gallery */
"We’ll notify you when we approve it!" = "เราจะแจ้งให้คุณทราบเมื่อเราอนุญาต!";

/* Title */
"Gallery" = "แกลเลอรี่";

/* Title */
"Shortcuts" = "คำสั่งลัด";

/* Title for button that is shown after the user submits a shortcut to the gallery to share their workflow. */
"Spread the Word" = "ส่งต่อเรื่องราว";

/* Title for the description field when submitting a workflow to the gallery */
"Description" = "คำอธิบาย";

/* Title for the longer-form description field when submitting a workflow to the gallery */
"Long Description" = "คำอธิบายที่ยาว";

/* Title for the short description field when submitting a workflow to the gallery */
"Short Description" = "คำอธิบายแบบย่อ";

/* Title for workflow name field when submitting a workflow to the gallery */
"Workflow Name" = "ชื่อเวิร์กโฟลว์";

/* Title of Siri feature on splash screen */
"Just Ask Siri" = "เพียงแค่ถาม Siri";

/* Title of alert encouraging users to add the Shortcuts widget after they have tried to skip adding the widget. */
"Add the Widget?" = "เพิ่มวิดเจ็ตหรือไม่";

/* Title of alert when a user tries to import a shortcut with the same name; %@ = shortcut name */
"You already have a shortcut named “%@”." = "คุณมีคำสั่งลัดชื่อ “%@” อยู่แล้ว";

/* Title of alert when the user’s gallery submission didn’t go through due to an error */
"Uh Oh" = "แย่แล้ว";

/* Title of intro feature on splash screen */
"Take the Shortest Path" = "ใช้วิธีที่สั้นที่สุด";

/* Title of main screen showing your library of shortcuts */
"Library" = "คลัง";

/* Title of widget feature on splash screen */
"Shortcuts Widget" = "วิดเจ็ตคำสั่งลัด";

/* Title; shortcuts database on device is corrupt */
"Corrupt Database" = "ฐานข้อมูลเสียหาย";

/* Today Widget; button to view the shortcut gallery */
"View the Gallery…" = "ดูแกลเลอรี่…";

/* Today widget button; manage shortcuts that appear in the today widget */
"Manage Shortcuts…" = "จัดการคำสั่งลัด…";

/* Today widget button; manage workflows that appear in the today widget */
"Customize in Shortcuts" = "กำหนดเองในคำสั่งลัด";

/* Today widget walkthough; user found widget and should add it */
"You found the widget! Tap *Add Widget* to access this from anywhere." = "คุณพบวิดเจ็ตแล้ว! แตะ *เพิ่มวิดเจ็ต* เพื่อเข้าถึงวิดเจ็ตนี้จากที่ใดก็ได้";

/* Today widget walkthough; user found widget and should come back here */
"You found the widget! Come back here to run your shortcuts quickly." = "คุณพบวิดเจ็ตแล้ว! กลับมาที่นี่เพื่อให้สั่งทำงานคำสั่งลัดของคุณได้อย่างรวดเร็ว";

/* Today widget; empty state */
"No Shortcuts" = "ไม่มีคำสั่งลัด";

/* Today widget; see the rest of the shortcuts in the widget */
"Tap to see the rest" = "แตะเพื่อดูส่วนที่เหลือ";

/* Twitter handle label or share via Twitter */
"Twitter" = "ทวิตเตอร์";

/* Waiting for the gallery to load. Shown under loading indicator */
"Loading" = "กำลังโหลด";

/* Watch app button; stop running the shortcut */
"Stop" = "หยุด";

/* Watch app, title for switch to show and hide a shortcut */
"Show/Hide" = "แสดง/ซ่อน";

/* Watch app; Change text field text */
"Tap to Change" = "แตะเพื่อเปลี่ยน";

/* Watch app; Compose a message */
"Create Message" = "สร้างข้อความ";

/* Watch app; Plus/Minus button name for number pad */
"Plus/Minus" = "บวก/ลบ";

/* Watch app; Shown under a title of an article; %@=author of article */
"by %@" = "โดย %@";

/* Watch app; email composer, email address from which to send the mail */
"From Address" = "จากที่อยู่";

/* Watch app; email composer; bcc address label */
"Bcc" = "สำเนาลับ";

/* Watch app; email composer; cc address label */
"Cc" = "สำเนา";

/* Watch app; email composer; from address label */
"From" = "จาก";

/* Watch app; email composer; indicates files are attached; %@=number of files attached */
"Attached (%ld)" = "แนบอยู่ (%ld)";

/* Watch app; email composer; subject label */
"Subject" = "หัวเรื่อง";

/* Watch app; email composer; to address label */
"To" = "ถึง";

/* Watch app; location could not be determined for an address */
"Location Not Found" = "ไม่พบตำแหน่งที่ตั้ง";

/* Watch app; mail compoer cc/bcc field label */
"Cc/Bcc" = "สำเนา/สำเนาลับ";

/* Watch app; number field placeholder */
"Enter number…" = "ป้อนตัวเลข…";

/* Watch app; send message error message */
"You must choose a contact to send a message to." = "คุณต้องเลือกรายชื่อที่จะส่งข้อความไปถึง";

/* Watch app; send the email */
"Send" = "ส่ง";

/* Watch app; share QuickLook content */
"Share" = "แชร์";

/* Watch app; shown when user needs to allow access to a certain resource such as Photo Library access; %@=shortcut name */
"Use Handoff on your iPhone to allow access for %@." = "ใช้ Handoff บน iPhone ของคุณเพื่ออนุญาตการเข้าถึงสำหรับ %@";

/* Watch app; tell user that they can use the Handoff feature to continue running the rest of the shortcut on their phone */
"Use Handoff on your iPhone to continue the shortcut." = "ใช้ Handoff บน iPhone ของคุณเพื่อดำเนินการสั่งทำงานคำสั่งลัดต่อ";

/* Watch app; text field placeholder */
"Enter text…" = "ป้อนข้อความ…";

/* Watch app; view current content on the phone */
"View on iPhone" = "ดูบน iPhone";

/* Watch complication; no shortcuts have been added (modular large complication) */
"No shortcuts have been added." = "ไม่ได้เพิ่มคำสั่งลัด";

/* Watch complication; no shortcuts have been added (utilitarian small complication, text should be short) */
"No Shortcuts (Short)" = "ไม่มีคำสั่งลัด";

/* Website URL label */
"Website" = "เว็บไซต์";

/* Widget tutorial headline; how to add Today Widget */
"Adding the Widget" = "การเพิ่มวิดเจ็ต";

/* Widget tutorial; accessiblity description */
"An animation of pressing firmly on the Shortcuts home screen icon to open the widget" = "ภาพเคลื่อนไหวของการกดลงน้ำหนักบนไอคอนหน้าจอโฮมของคำสั่งลัดเพื่อเปิดวิดเจ็ต";

/* Widget tutorial; how to add Today Widget */
"Tap + to add the Shortcuts Widget. Tap “Done.”" = "แตะ + เพื่อเพิ่มวิดเจ็ตคำสั่งลัด แตะ “เสร็จสิ้น”";

/* Widget tutorial; how to add Today Widget on devices that don’t have a home button on iOS 10 and above */
"Swipe up to go home, press firmly on the Shortcuts icon, and tap “Add Widget.”" = "ปัดขึ้นไปที่หน้าโฮม กดลงน้ำหนักบนไอคอนคำสั่งลัด แล้วแตะ “เพิ่มวิดเจ็ต”";

/* Widget tutorial; how to add Today Widget on devices that have a home button on iOS 10 and above */
"Press the Home button, press firmly on the Shortcuts icon, and tap “Add Widget.”" = "กดปุ่มโฮม กดลงน้ำหนักบนไอคอนคำสั่งลัด แล้วแตะ “เพิ่มวิดเจ็ต”";

/* Widget tutorial; how to add Today Widget on iOS 10, iPad and iPhone, non-3D Touch, iOS 8 and 9 step 3 */
"Scroll to the bottom and\ntap “Edit.”" = "เลื่อนลงด้านล่างสุดแล้ว\nแตะ “แก้ไข”";

/* Widget tutorial; how to add Today Widget on iOS 8 and 9 & iOS 10, iPad and iPhone, non-3D Touch step 2 */
"Swipe to the left to view\nyour widgets." = "ปัดไปทางซ้ายเพื่อดู\nวิดเจ็ตของคุณ";

/* Widget tutorial; how to add Today Widget on iOS 8 and 9, iPad step 2 */
"On the lower left, scroll\ndown and tap “Edit.”" = "ที่ด้านซ้ายล่าง ให้เลื่อน\nลงแล้วแตะ “แก้ไข”";

/* Widget tutorial; how to add Today Widget step 1 */
"Swipe down from the top to reveal Notification Center." = "ปัดลงจากด้านบนสุดเพื่อแสดงศูนย์การแจ้งเตือน";

/* Your shortcut is ready to share as a link */
"Your shortcut is ready to share!" = "คำสั่งลัดของคุณพร้อมให้แชร์แล้ว!";

/* date range; $@=time until; appended to date with time (e.g. Today 5pm to 6pm); please include space for relevant languages */
" to %@" = " ถึง %@";

/* date range; %1$@ = start date; %2$@ = end date */
"%1$@ to %2$@" = "%1$@ ถึง %2$@";

/* opposite of “left”; should be “left” for RTL languages */
"right" = "ขวา";

